XMLFile1.xml

<SOAP-ENV:Envelope xmlns:awl="http://finstream.ru/csp/awl" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header>
    <Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <UsernameToken>
        <Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">IBank456</Password>
        <Username>I_Bank2</Username>
      </UsernameToken>
    </Security>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <awl:STEP>
      <awl:RSTEP ID="AWGW579843" ReqDateTime="2024-08-29T16:52:30" Type="AWRSTEP">
        <awl:AWHead Channel="finstream" Check="true" CustomerID="finstream_1" DeptID="finstream_2" Lang="RU" TermNo="term"></awl:AWHead>
        <awl:AWRequest A="200" CUR="RUB" Lang="rus" PUREF="PDOG||1228" Space="true" Step="1">
          <awl:ADDITIONAL FIELDID="1" FIELDNAME="transactionId" FIELDVALUE="39984826"></awl:ADDITIONAL>
        </awl:AWRequest>
      </awl:RSTEP>
    </awl:STEP>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>